Revit 2027 API
BalusterInfo.GetReferenceNameForTopRail Method
 Gets the name string to be used as a reference to Top Rail in the current language.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetReferenceNameForTopRail()
Public Shared Function GetReferenceNameForTopRail As String
public:
static String^ GetReferenceNameForTopRail()
static member GetReferenceNameForTopRail : unit -> string
Return Value
String
 The name string to be used as a reference to Top Rail.
Remarks
 This name can be used in the setter for BaseReferenceName or TopReferenceName. The name can also be compared with the value coming from the getter.
See Also
Reference
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace